In [6]:
import pandas as pd
import numpy as np

In [3]:
days= pd.Series(['Monday','Tuesday','Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [11]:
#Creating series with a numpy array
days_list=np.array(['monday', 'tuesday','wednesday'])
print(days_list)

['monday' 'tuesday' 'wednesday']

In [10]:
days_num=pd.Series(days_list)
print(days_num)

0       monday
1      tuesday
2    wednesday
dtype: object

In [12]:
#indexing with strings
days=pd.Series(['monday','tuesday','wednesday'],
              index=['a', 'b','c'])
print(days)

a       monday
b      tuesday
c    wednesday
dtype: object

In [13]:
#creating series from a dictionary
days1=pd.Series({'e': 'thursday', 'f':'friday', 'g':'saturday'})
print(days1)

e    thursday
f      friday
g    saturday
dtype: object

In [14]:
days1[0]

'thursday'

In [15]:
days1[1: ]

f      friday
g    saturday
dtype: object

In [16]:
days1[0: ]

e    thursday
f      friday
g    saturday
dtype: object

In [17]:
days1[ :2]

e    thursday
f      friday
dtype: object

In [18]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [22]:
#creating a dataframe from a dictionary
df_dict = {'country': ['Ghana','Kenya', 'Nigeria','Togo'],
          'Capital' :['Accra', 'Nairobi','Abuja','Lome'],
          'Population' : [10000, 8500, 35000, 12000],
          'Age' : [60, 70, 80,75]}
print(df_dict)

{'country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'], 'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'], 'Population': [10000, 8500, 35000, 12000], 'Age': [60, 70, 80, 75]}

In [26]:
df_dict1=pd.DataFrame(df_dict, index =[2,4,6,8])
print(df_dict)

{'country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'], 'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'], 'Population': [10000, 8500, 35000, 12000], 'Age': [60, 70, 80, 75]}

In [30]:
df_list =[['Ghana','Accra',10000, 60],
            ['Kenya', 'Nairobi',8500, 70],
          ['Nigeria','Abuja',35000, 80],
         ['Togo','lome',12000,75]]

In [34]:
df1 = pd.DataFrame(df_list, columns=['country','Capital','Popualtion','Age'], index=[2,4,6,8])
print(df1)

   country  Capital  Popualtion  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     lome       12000   75

df1.iloc[3]

# INDEXING IN PANDAS

In [36]:
#select row with index 3
df1.iloc[3]

country        Togo
Capital        lome
Popualtion    12000
Age              75
Name: 8, dtype: object

In [38]:
#select row with index label 8
df1.loc[4]

country         Kenya
Capital       Nairobi
Popualtion       8500
Age                70
Name: 4, dtype: object

In [39]:
#select a colum
df1['Capital']

2      Accra
4    Nairobi
6      Abuja
8       lome
Name: Capital, dtype: object

In [41]:
df1.iat[2,0]

'Nigeria'

In [49]:
df1.iat[3, 2]

12000

In [50]:
df1.at[8, 'Age']

75

In [51]:
df1.mean()

C:\Users\Ann\AppData\Local\Temp/ipykernel_7460/2053335143.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

Popualtion    16375.00
Age              71.25
dtype: float64

In [ ]:
df1['Population'].sum()

In [57]:
df1.describe()

         Popualtion        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

# DEALING WITH MISSING VALUES

In [59]:
df_dict2 ={'Name':['James','Yemen','Caro','np.nan'],
          'Profession': ['Recoder','Artist','Doctor','Writer'],
          'Experience': [12,np.nan,10,8],
          'Height':[np.nan,175,180,150]}

In [61]:
new_df=pd.DataFrame(df_dict2)
print(new_df)

     Name Profession  Experience  Height
0   James    Recoder        12.0     NaN
1   Yemen     Artist         NaN   175.0
2    Caro     Doctor        10.0   180.0
3  np.nan     Writer         8.0   150.0

In [62]:
new_df.isna()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3  False       False       False   False

In [65]:
new_df.dropna()

     Name Profession  Experience  Height
2    Caro     Doctor        10.0   180.0
3  np.nan     Writer         8.0   150.0